MikroElektronika/core_packages/PIC/XC8/def/PIC16F19196/mcu.h
// Register: RTCCON
#define RTCCON RTCCON
extern volatile unsigned char           RTCCON              __at(0xC0C);
#ifndef _LIB_BUILD
asm("RTCCON equ 0C0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCCLKSEL              :2;
        unsigned                        :1;
        unsigned HALFSEC                :1;
        unsigned RTCSYNC                :1;
        unsigned RTCWREN                :1;
        unsigned                        :1;
        unsigned RTCEN                  :1;
    };
    struct {
        unsigned RTCCLKSEL0             :1;
        unsigned RTCCLKSEL1             :1;
    };
} RTCCONbits_t;
extern volatile RTCCONbits_t RTCCONbits __at(0xC0C);
// bitfield macros
#define _RTCCON_RTCCLKSEL_POSN                              0x0
#define _RTCCON_RTCCLKSEL_POSITION                          0x0
#define _RTCCON_RTCCLKSEL_SIZE                              0x2
#define _RTCCON_RTCCLKSEL_LENGTH                            0x2
#define _RTCCON_RTCCLKSEL_MASK                              0x3
#define _RTCCON_HALFSEC_POSN                                0x3
#define _RTCCON_HALFSEC_POSITION                            0x3
#define _RTCCON_HALFSEC_SIZE                                0x1
#define _RTCCON_HALFSEC_LENGTH                              0x1
#define _RTCCON_HALFSEC_MASK                                0x8
#define _RTCCON_RTCSYNC_POSN                                0x4
#define _RTCCON_RTCSYNC_POSITION                            0x4
#define _RTCCON_RTCSYNC_SIZE                                0x1
#define _RTCCON_RTCSYNC_LENGTH                              0x1
#define _RTCCON_RTCSYNC_MASK                                0x10
#define _RTCCON_RTCWREN_POSN                                0x5
#define _RTCCON_RTCWREN_POSITION                            0x5
#define _RTCCON_RTCWREN_SIZE                                0x1
#define _RTCCON_RTCWREN_LENGTH                              0x1
#define _RTCCON_RTCWREN_MASK                                0x20
#define _RTCCON_RTCEN_POSN                                  0x7
#define _RTCCON_RTCEN_POSITION                              0x7
#define _RTCCON_RTCEN_SIZE                                  0x1
#define _RTCCON_RTCEN_LENGTH                                0x1
#define _RTCCON_RTCEN_MASK                                  0x80
#define _RTCCON_RTCCLKSEL0_POSN                             0x0
#define _RTCCON_RTCCLKSEL0_POSITION                         0x0
#define _RTCCON_RTCCLKSEL0_SIZE                             0x1
#define _RTCCON_RTCCLKSEL0_LENGTH                           0x1
#define _RTCCON_RTCCLKSEL0_MASK                             0x1
#define _RTCCON_RTCCLKSEL1_POSN                             0x1
#define _RTCCON_RTCCLKSEL1_POSITION                         0x1
#define _RTCCON_RTCCLKSEL1_SIZE                             0x1
#define _RTCCON_RTCCLKSEL1_LENGTH                           0x1
#define _RTCCON_RTCCLKSEL1_MASK                             0x2

// Register: RTCCAL
#define RTCCAL RTCCAL
extern volatile unsigned char           RTCCAL              __at(0xC0D);
#ifndef _LIB_BUILD
asm("RTCCAL equ 0C0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CAL                    :8;
    };
    struct {
        unsigned CAL0                   :1;
        unsigned CAL1                   :1;
        unsigned CAL2                   :1;
        unsigned CAL3                   :1;
        unsigned CAL4                   :1;
        unsigned CAL5                   :1;
        unsigned CAL6                   :1;
        unsigned CAL7                   :1;
    };
} RTCCALbits_t;
extern volatile RTCCALbits_t RTCCALbits __at(0xC0D);
// bitfield macros
#define _RTCCAL_CAL_POSN                                    0x0
#define _RTCCAL_CAL_POSITION                                0x0
#define _RTCCAL_CAL_SIZE                                    0x8
#define _RTCCAL_CAL_LENGTH                                  0x8
#define _RTCCAL_CAL_MASK                                    0xFF
#define _RTCCAL_CAL0_POSN                                   0x0
#define _RTCCAL_CAL0_POSITION                               0x0
#define _RTCCAL_CAL0_SIZE                                   0x1
#define _RTCCAL_CAL0_LENGTH                                 0x1
#define _RTCCAL_CAL0_MASK                                   0x1
#define _RTCCAL_CAL1_POSN                                   0x1
#define _RTCCAL_CAL1_POSITION                               0x1
#define _RTCCAL_CAL1_SIZE                                   0x1
#define _RTCCAL_CAL1_LENGTH                                 0x1
#define _RTCCAL_CAL1_MASK                                   0x2
#define _RTCCAL_CAL2_POSN                                   0x2
#define _RTCCAL_CAL2_POSITION                               0x2
#define _RTCCAL_CAL2_SIZE                                   0x1
#define _RTCCAL_CAL2_LENGTH                                 0x1
#define _RTCCAL_CAL2_MASK                                   0x4
#define _RTCCAL_CAL3_POSN                                   0x3
#define _RTCCAL_CAL3_POSITION                               0x3
#define _RTCCAL_CAL3_SIZE                                   0x1
#define _RTCCAL_CAL3_LENGTH                                 0x1
#define _RTCCAL_CAL3_MASK                                   0x8
#define _RTCCAL_CAL4_POSN                                   0x4
#define _RTCCAL_CAL4_POSITION                               0x4
#define _RTCCAL_CAL4_SIZE                                   0x1
#define _RTCCAL_CAL4_LENGTH                                 0x1
#define _RTCCAL_CAL4_MASK                                   0x10
#define _RTCCAL_CAL5_POSN                                   0x5
#define _RTCCAL_CAL5_POSITION                               0x5
#define _RTCCAL_CAL5_SIZE                                   0x1
#define _RTCCAL_CAL5_LENGTH                                 0x1
#define _RTCCAL_CAL5_MASK                                   0x20
#define _RTCCAL_CAL6_POSN                                   0x6
#define _RTCCAL_CAL6_POSITION                               0x6
#define _RTCCAL_CAL6_SIZE                                   0x1
#define _RTCCAL_CAL6_LENGTH                                 0x1
#define _RTCCAL_CAL6_MASK                                   0x40
#define _RTCCAL_CAL7_POSN                                   0x7
#define _RTCCAL_CAL7_POSITION                               0x7
#define _RTCCAL_CAL7_SIZE                                   0x1
#define _RTCCAL_CAL7_LENGTH                                 0x1
#define _RTCCAL_CAL7_MASK                                   0x80

// Register: ALRMCON
#define ALRMCON ALRMCON
extern volatile unsigned char           ALRMCON             __at(0xC0E);
#ifndef _LIB_BUILD
asm("ALRMCON equ 0C0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned AMASK                  :4;
        unsigned CHIME                  :1;
        unsigned ALRMEN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned AMASK0                 :1;
        unsigned AMASK1                 :1;
        unsigned AMASK2                 :1;
        unsigned AMASK3                 :1;
    };
} ALRMCONbits_t;
extern volatile ALRMCONbits_t ALRMCONbits __at(0xC0E);
// bitfield macros
#define _ALRMCON_AMASK_POSN                                 0x2
#define _ALRMCON_AMASK_POSITION                             0x2
#define _ALRMCON_AMASK_SIZE                                 0x4
#define _ALRMCON_AMASK_LENGTH                               0x4
#define _ALRMCON_AMASK_MASK                                 0x3C
#define _ALRMCON_CHIME_POSN                                 0x6
#define _ALRMCON_CHIME_POSITION                             0x6
#define _ALRMCON_CHIME_SIZE                                 0x1
#define _ALRMCON_CHIME_LENGTH                               0x1
#define _ALRMCON_CHIME_MASK                                 0x40
#define _ALRMCON_ALRMEN_POSN                                0x7
#define _ALRMCON_ALRMEN_POSITION                            0x7
#define _ALRMCON_ALRMEN_SIZE                                0x1
#define _ALRMCON_ALRMEN_LENGTH                              0x1
#define _ALRMCON_ALRMEN_MASK                                0x80
#define _ALRMCON_AMASK0_POSN                                0x2
#define _ALRMCON_AMASK0_POSITION                            0x2
#define _ALRMCON_AMASK0_SIZE                                0x1
#define _ALRMCON_AMASK0_LENGTH                              0x1
#define _ALRMCON_AMASK0_MASK                                0x4
#define _ALRMCON_AMASK1_POSN                                0x3
#define _ALRMCON_AMASK1_POSITION                            0x3
#define _ALRMCON_AMASK1_SIZE                                0x1
#define _ALRMCON_AMASK1_LENGTH                              0x1
#define _ALRMCON_AMASK1_MASK                                0x8
#define _ALRMCON_AMASK2_POSN                                0x4
#define _ALRMCON_AMASK2_POSITION                            0x4
#define _ALRMCON_AMASK2_SIZE                                0x1
#define _ALRMCON_AMASK2_LENGTH                              0x1
#define _ALRMCON_AMASK2_MASK                                0x10
#define _ALRMCON_AMASK3_POSN                                0x5
#define _ALRMCON_AMASK3_POSITION                            0x5
#define _ALRMCON_AMASK3_SIZE                                0x1
#define _ALRMCON_AMASK3_LENGTH                              0x1
#define _ALRMCON_AMASK3_MASK                                0x20

