MikroElektronika/core_packages/PIC/XC8/def/PIC16F19196/mcu.h
extern volatile LCDDATA33bits_t LCDDATA33bits __at(0x1D39);
// bitfield macros
#define _LCDDATA33_S24C5_POSN                               0x0
#define _LCDDATA33_S24C5_POSITION                           0x0
#define _LCDDATA33_S24C5_SIZE                               0x1
#define _LCDDATA33_S24C5_LENGTH                             0x1
#define _LCDDATA33_S24C5_MASK                               0x1
#define _LCDDATA33_S25C5_POSN                               0x1
#define _LCDDATA33_S25C5_POSITION                           0x1
#define _LCDDATA33_S25C5_SIZE                               0x1
#define _LCDDATA33_S25C5_LENGTH                             0x1
#define _LCDDATA33_S25C5_MASK                               0x2
#define _LCDDATA33_S26C5_POSN                               0x2
#define _LCDDATA33_S26C5_POSITION                           0x2
#define _LCDDATA33_S26C5_SIZE                               0x1
#define _LCDDATA33_S26C5_LENGTH                             0x1
#define _LCDDATA33_S26C5_MASK                               0x4
#define _LCDDATA33_S27C5_POSN                               0x3
#define _LCDDATA33_S27C5_POSITION                           0x3
#define _LCDDATA33_S27C5_SIZE                               0x1
#define _LCDDATA33_S27C5_LENGTH                             0x1
#define _LCDDATA33_S27C5_MASK                               0x8
#define _LCDDATA33_S28C5_POSN                               0x4
#define _LCDDATA33_S28C5_POSITION                           0x4
#define _LCDDATA33_S28C5_SIZE                               0x1
#define _LCDDATA33_S28C5_LENGTH                             0x1
#define _LCDDATA33_S28C5_MASK                               0x10
#define _LCDDATA33_S29C5_POSN                               0x5
#define _LCDDATA33_S29C5_POSITION                           0x5
#define _LCDDATA33_S29C5_SIZE                               0x1
#define _LCDDATA33_S29C5_LENGTH                             0x1
#define _LCDDATA33_S29C5_MASK                               0x20
#define _LCDDATA33_S30C5_POSN                               0x6
#define _LCDDATA33_S30C5_POSITION                           0x6
#define _LCDDATA33_S30C5_SIZE                               0x1
#define _LCDDATA33_S30C5_LENGTH                             0x1
#define _LCDDATA33_S30C5_MASK                               0x40
#define _LCDDATA33_S31C5_POSN                               0x7
#define _LCDDATA33_S31C5_POSITION                           0x7
#define _LCDDATA33_S31C5_SIZE                               0x1
#define _LCDDATA33_S31C5_LENGTH                             0x1
#define _LCDDATA33_S31C5_MASK                               0x80

// Register: LCDDATA34
#define LCDDATA34 LCDDATA34
extern volatile unsigned char           LCDDATA34           __at(0x1D3A);
#ifndef _LIB_BUILD
asm("LCDDATA34 equ 01D3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C5                  :1;
        unsigned S33C5                  :1;
        unsigned S34C5                  :1;
        unsigned S35C5                  :1;
        unsigned S36C5                  :1;
        unsigned S37C5                  :1;
        unsigned S38C5                  :1;
        unsigned S39C5                  :1;
    };
} LCDDATA34bits_t;
extern volatile LCDDATA34bits_t LCDDATA34bits __at(0x1D3A);
// bitfield macros
#define _LCDDATA34_S32C5_POSN                               0x0
#define _LCDDATA34_S32C5_POSITION                           0x0
#define _LCDDATA34_S32C5_SIZE                               0x1
#define _LCDDATA34_S32C5_LENGTH                             0x1
#define _LCDDATA34_S32C5_MASK                               0x1
#define _LCDDATA34_S33C5_POSN                               0x1
#define _LCDDATA34_S33C5_POSITION                           0x1
#define _LCDDATA34_S33C5_SIZE                               0x1
#define _LCDDATA34_S33C5_LENGTH                             0x1
#define _LCDDATA34_S33C5_MASK                               0x2
#define _LCDDATA34_S34C5_POSN                               0x2
#define _LCDDATA34_S34C5_POSITION                           0x2
#define _LCDDATA34_S34C5_SIZE                               0x1
#define _LCDDATA34_S34C5_LENGTH                             0x1
#define _LCDDATA34_S34C5_MASK                               0x4
#define _LCDDATA34_S35C5_POSN                               0x3
#define _LCDDATA34_S35C5_POSITION                           0x3
#define _LCDDATA34_S35C5_SIZE                               0x1
#define _LCDDATA34_S35C5_LENGTH                             0x1
#define _LCDDATA34_S35C5_MASK                               0x8
#define _LCDDATA34_S36C5_POSN                               0x4
#define _LCDDATA34_S36C5_POSITION                           0x4
#define _LCDDATA34_S36C5_SIZE                               0x1
#define _LCDDATA34_S36C5_LENGTH                             0x1
#define _LCDDATA34_S36C5_MASK                               0x10
#define _LCDDATA34_S37C5_POSN                               0x5
#define _LCDDATA34_S37C5_POSITION                           0x5
#define _LCDDATA34_S37C5_SIZE                               0x1
#define _LCDDATA34_S37C5_LENGTH                             0x1
#define _LCDDATA34_S37C5_MASK                               0x20
#define _LCDDATA34_S38C5_POSN                               0x6
#define _LCDDATA34_S38C5_POSITION                           0x6
#define _LCDDATA34_S38C5_SIZE                               0x1
#define _LCDDATA34_S38C5_LENGTH                             0x1
#define _LCDDATA34_S38C5_MASK                               0x40
#define _LCDDATA34_S39C5_POSN                               0x7
#define _LCDDATA34_S39C5_POSITION                           0x7
#define _LCDDATA34_S39C5_SIZE                               0x1
#define _LCDDATA34_S39C5_LENGTH                             0x1
#define _LCDDATA34_S39C5_MASK                               0x80

// Register: LCDDATA35
#define LCDDATA35 LCDDATA35
extern volatile unsigned char           LCDDATA35           __at(0x1D3B);
#ifndef _LIB_BUILD
asm("LCDDATA35 equ 01D3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C5                  :1;
        unsigned S41C5                  :1;
        unsigned S42C5                  :1;
        unsigned S43C5                  :1;
        unsigned S44C5                  :1;
        unsigned S45C5                  :1;
    };
} LCDDATA35bits_t;
extern volatile LCDDATA35bits_t LCDDATA35bits __at(0x1D3B);
// bitfield macros
#define _LCDDATA35_S40C5_POSN                               0x0
#define _LCDDATA35_S40C5_POSITION                           0x0
#define _LCDDATA35_S40C5_SIZE                               0x1
#define _LCDDATA35_S40C5_LENGTH                             0x1
#define _LCDDATA35_S40C5_MASK                               0x1
#define _LCDDATA35_S41C5_POSN                               0x1
#define _LCDDATA35_S41C5_POSITION                           0x1
#define _LCDDATA35_S41C5_SIZE                               0x1
#define _LCDDATA35_S41C5_LENGTH                             0x1
#define _LCDDATA35_S41C5_MASK                               0x2
#define _LCDDATA35_S42C5_POSN                               0x2
#define _LCDDATA35_S42C5_POSITION                           0x2
#define _LCDDATA35_S42C5_SIZE                               0x1
#define _LCDDATA35_S42C5_LENGTH                             0x1
#define _LCDDATA35_S42C5_MASK                               0x4
#define _LCDDATA35_S43C5_POSN                               0x3
#define _LCDDATA35_S43C5_POSITION                           0x3
#define _LCDDATA35_S43C5_SIZE                               0x1
#define _LCDDATA35_S43C5_LENGTH                             0x1
#define _LCDDATA35_S43C5_MASK                               0x8
#define _LCDDATA35_S44C5_POSN                               0x4
#define _LCDDATA35_S44C5_POSITION                           0x4
#define _LCDDATA35_S44C5_SIZE                               0x1
#define _LCDDATA35_S44C5_LENGTH                             0x1
#define _LCDDATA35_S44C5_MASK                               0x10
#define _LCDDATA35_S45C5_POSN                               0x5
#define _LCDDATA35_S45C5_POSITION                           0x5
#define _LCDDATA35_S45C5_SIZE                               0x1
#define _LCDDATA35_S45C5_LENGTH                             0x1
#define _LCDDATA35_S45C5_MASK                               0x20

